src/cf/InformationRegisters/ExternalModulesAttachmentModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ExternalModulesAttachmentModes</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>SafeMode</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.SafeMode</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>SoftwareModulePresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ProgramModuleType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExtensionObjectIDs</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ModuleID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ExternalModulesAttachmentModes/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// Returns the connection mode of the external module.
//
// Parameters:
//  ProgramModule - AnyRef -  the link corresponding to the software module for which
//    the connection mode is requested.
//
// Returns:
//   String - 
//  
//
Function ExternalModuleAttachmentMode(Val ProgramModule) Export
	
	If SafeModeManager.SafeModeSet() Then
		// 
		// 
		Return SafeMode();
	EndIf;
		
	SetPrivilegedMode(True);
	
	ModuleProperties = SafeModeManagerInternal.PropertiesForPermissionRegister(ProgramModule);
	Query = New Query(
		"SELECT
		|	ExternalModulesAttachmentModes.SafeMode
		|FROM
		|	InformationRegister.ExternalModulesAttachmentModes AS ExternalModulesAttachmentModes
		|WHERE
		|	ExternalModulesAttachmentModes.ProgramModuleType = &ProgramModuleType
		|	AND ExternalModulesAttachmentModes.ModuleID = &ModuleID");
	
	Query.SetParameter("ProgramModuleType", ModuleProperties.Type);
	Query.SetParameter("ModuleID", ModuleProperties.Id);
	QuerySelection = Query.Execute().Select();
	If QuerySelection.Next() Then
		Result = QuerySelection.SafeMode;
	Else
		Result = Undefined;
	EndIf;
	
	SSLSubsystemsIntegration.OnAttachExternalModule(ProgramModule, Result);
	SafeModeManagerOverridable.OnAttachExternalModule(ProgramModule, Result);
	Return Result;
	
EndFunction

#EndRegion

#EndIf
